// Для данного .cpp файла отключено использование precompiled headers
// (отключаются в настройках проекта)
// Это нужно для того, чтобы компилятор не требовал обязательного включения
// stdafx.h в начале этого .cpp файла
// В stdafx.h подключается библиотека Catch без генерирования функции main
// Это необходимо для того, чтобы в каждом из .cpp-файлов (с тестами)
// не подключать её явно

// Макрос CATCH_CONFIG_MAIN говорит библиотеке Catch сгенерировать
// функцию main, выполняющую разбор аргументов командной строки и запуск тестов
// Это должно быть сделано только в одном из .cpp файлов проекта (в этом)
#define CATCH_CONFIG_MAIN 
#include "../../../catch/catch.hpp"

// Больше в этом файле ничего не должно быть. Тесты следует располагать в 
// других .cpp файлах